// 2. 🌟🌟
#![allow(unused)]
fn demo() {
    {
        let x = 5;             // ----------+-- 'b
                                    //           |
        let r = &x;           // --+-- 'a  |
                                    //   |       |
        println!("r: {}", r);       //   |       |
                                    // --+       |
    }                                // ----------+
}

/* 像上面的示例一样，为 `r` 和 `x` 标准生命周期，然后从生命周期的角度. */

fn main() {
    {
        let r;          // ---------+-- 'a
                              //          |
        {                     //          |
            let x = 5;   // -+-- 'b  |
            r = /*&*/x        //  |       |
        }                     // -+       |
                              //          |
        println!("r: {}", r); //          |
    }                         // ---------+
}
